In [1]:
import pandas as pd

In [ ]:
# pd.Series([10,4,2,6])
# seri.axes
# seri.dtype
# seri.size
# seri.ndim
# seri.values
# seri.head()
# seri.tail(3)
# pd.Series([12,43,55,123,45], index = [1,5,2,3,4])
# pd.Series({'reg':10, "dfdf":12})
# pd.concat([sozluk,yeniSeri])
# yeniSeri.index
# yeniSeri.keys
# list(seri.items())
# seri.values
# df = pd.DataFrame(m, columns = ['degisken_ismi','desf','dd'])
# df.columns = ["deg1",'deg2','deg3']
# df.drop('a', axis = 0)
# df.drop('a', axis = 0, inplace = True)
# df['var4'] = df['deg1']/df['deg2']
# df.loc['b':'c']
# df.iloc[1:2]
# pd.concat([df1,df2], ignore_index = True)
# pd.concat([df1,df2],join = 'inner')
# pd.concat([df1,df2], join_axes = [df2.columns])
# pd.merge(df1,df2)
# pd.merge(df1,df2, on='calisanlar')
# df = sns.load_dataset('planets')
# df['mass'].mean()
# df['mass'].std()
# df.describe()
# df3.groupby('grup')
# df.describe().T
# df3.groupby('grup').mean()
# df.groupby('method')['orbital_period']
# df.groupby('method')['orbital_period'].describe()
# df.groupby('method').aggregate(['min', np.median, max])
# df.groupby('mass').filter(filter_func)
# titanic.groupby(['sex','class'])[['survived']].aggregate('mean').unstack()
# df.apply(np.sum)
# df.transform(lambda x: x-x.mean())
# age = pd.cut(titanic['age'], [0,18,90])
# titanic.pivot_table('survived',index = 'sex',columns = 'class')
# pd.read_csv('~/Desktop/ornekcsv.csv', sep = ';')
# pd.read_csv('~/Desktop/duz_metin.txt')
# pd.read_excel('~/Desktop/ornekx.xlsx')
#

In [5]:
seri = pd.Series([10,4,2,6])

In [6]:
seri

0    10
1     4
2     2
3     6
dtype: int64

In [7]:
type(seri)

pandas.core.series.Series

In [8]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [9]:
seri.dtype

dtype('int64')

In [10]:
seri.size

4

In [11]:
seri.ndim

1

In [12]:
seri.values

array([10,  4,  2,  6])

In [13]:
seri.head()

0    10
1     4
2     2
3     6
dtype: int64

In [14]:
seri.tail(3)

1    4
2    2
3    6
dtype: int64

In [15]:
pd.Series([12,43,55,123,45], index = [1,5,2,3,4])

1     12
5     43
2     55
3    123
4     45
dtype: int64

In [17]:
x = pd.Series([12,43,55,123,45], index = ['a','b','c','d','e'])

In [18]:
x

a     12
b     43
c     55
d    123
e     45
dtype: int64

In [19]:
x['a']

12

In [20]:
x['a':'c']

a    12
b    43
c    55
dtype: int64

In [21]:
sozluk = pd.Series({'reg':10, "dfdf":12})

In [22]:
sozluk

reg     10
dfdf    12
dtype: int64

In [23]:
ikinciSozluk = {'dd':12, 'dsds':54}

In [24]:
yeniSeri = pd.Series(ikinciSozluk)

In [25]:
yeniSeri

dd      12
dsds    54
dtype: int64

In [27]:
pd.concat([sozluk,yeniSeri])

reg     10
dfdf    12
dd      12
dsds    54
dtype: int64

In [28]:
yeniSeri.index

Index(['dd', 'dsds'], dtype='object')

In [29]:
yeniSeri.keys

<bound method Series.keys of dd      12
dsds    54
dtype: int64>

In [30]:
list(seri.items())

[(0, 10), (1, 4), (2, 2), (3, 6)]

In [31]:
seri.values

array([10,  4,  2,  6])

In [34]:
yeniSeri[['dd', 'dsds']]

dd      12
dsds    54
dtype: int64

In [42]:
#pandas dataframe olusturma
import numpy as np
m = np.arange(1,10).reshape(3,3)

In [47]:
df = pd.DataFrame(m, columns = ['degisken_ismi','desf','dd'])

In [48]:
df

   degisken_ismi  desf  dd
0              1     2   3
1              4     5   6
2              7     8   9

In [49]:
df.columns = ["deg1",'deg2','deg3']

In [50]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [51]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [52]:
df.shape

(3, 3)

In [53]:
df.ndim

2

In [54]:
df.size

9

In [55]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [56]:
df.head

<bound method NDFrame.head of    deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9>

In [57]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [63]:

s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10,size =5)
s3 = np.random.randint(10, size= 5)

In [61]:
sozlugum = {'1':s1,'2':s2,'3':s3}

In [65]:
sozlugum

{'1': array([2, 7, 9, 6, 2]),
 '2': array([8, 3, 0, 0, 2]),
 '3': array([7, 1, 8, 8, 9])}

In [66]:
df1 = pd.DataFrame(sozlugum)

In [67]:
df1

   1  2  3
0  2  8  7
1  7  3  1
2  9  0  8
3  6  0  8
4  2  2  9

In [68]:
df1[0:1]

   1  2  3
0  2  8  7

In [69]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [71]:
df.index = ['a','b','c']

In [72]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [73]:
df['b':'c']

   deg1  deg2  deg3
b     4     5     6
c     7     8     9

In [74]:
df.drop('a', axis = 0)

   deg1  deg2  deg3
b     4     5     6
c     7     8     9

In [75]:
df

   deg1  deg2  deg3
a     1     2     3
b     4     5     6
c     7     8     9

In [76]:
df.drop('a', axis = 0, inplace = True)
#onceki kalici olarak silmemisti, inplace ile kalici olarak sileriz

In [77]:
df

   deg1  deg2  deg3
b     4     5     6
c     7     8     9

In [78]:
x = ['c']

In [79]:
df.drop(x, axis = 0)

   deg1  deg2  deg3
b     4     5     6

In [80]:
df['var4'] = df['deg1']/df['deg2']

In [81]:
df

   deg1  deg2  deg3   var4
b     4     5     6  0.800
c     7     8     9  0.875

In [82]:
df.drop('var4', axis = 1, inplace = True)

In [83]:
df

   deg1  deg2  deg3
b     4     5     6
c     7     8     9

In [84]:
ll = ['deg1']

In [85]:
df.drop(ll, axis = 1)

   deg2  deg3
b     5     6
c     8     9

In [104]:
df.loc['b':'c']

   deg1  deg2  deg3
b     4     5     6
c     7     8     9

In [109]:
df.iloc[1:2]
#iloc ile sayisal index vererek kullaniriz genelde, loc ile sutun isimleriyle de secim yapabiliriz

   deg1  deg2  deg3
c     7     8     9

In [110]:
m = np.random.randint(1,30,size = (10,3))
df = pd.DataFrame(m, columns = ['var1','var2','var3'])
df

   var1  var2  var3
0    21    17     8
1    19    12    23
2    26    14    22
3    11    17    24
4    26    25     6
5    29     9    23
6    17    17     5
7    19     2    29
8    17    12     2
9    19    17    24

In [111]:
df['var1']

0    21
1    19
2    26
3    11
4    26
5    29
6    17
7    19
8    17
9    19
Name: var1, dtype: int64

In [114]:
df['var1'][0:3]

0    21
1    19
2    26
Name: var1, dtype: int64

In [115]:
df[0:3]['var1']

0    21
1    19
2    26
Name: var1, dtype: int64

In [118]:
df[0:3][['var1','var2']]

   var1  var2
0    21    17
1    19    12
2    26    14

In [119]:
df.var1

0    21
1    19
2    26
3    11
4    26
5    29
6    17
7    19
8    17
9    19
Name: var1, dtype: int64

In [123]:
df[df.var1>25]['var2']

2    14
4    25
5     9
Name: var2, dtype: int64

In [124]:
df[(df.var1>25) & (df.var2< 10)]['var2']

5    9
Name: var2, dtype: int64

In [127]:
df[(df.var1>25), ['var1','var2']]

TypeError: '(0    False
1    False
2     True
3    False
4     True
5     True
6    False
7    False
8    False
9    False
Name: var1, dtype: bool, ['var1', 'var2'])' is an invalid key

In [128]:
df.loc[(df.var1>25), ['var1','var2']]

   var1  var2
2    26    14
4    26    25
5    29     9

In [129]:
df2 = df1 + 34

In [130]:
df2

    1   2   3
0  36  42  41
1  41  37  35
2  43  34  42
3  40  34  42
4  36  36  43

In [132]:
pd.concat([df1,df2])

    1   2   3
0   2   8   7
1   7   3   1
2   9   0   8
3   6   0   8
4   2   2   9
0  36  42  41
1  41  37  35
2  43  34  42
3  40  34  42
4  36  36  43

In [133]:
#yukarida bir sikinti var!!!

In [134]:
pd.concat([df1,df2], ignore_index = True)

    1   2   3
0   2   8   7
1   7   3   1
2   9   0   8
3   6   0   8
4   2   2   9
5  36  42  41
6  41  37  35
7  43  34  42
8  40  34  42
9  36  36  43

In [135]:
# cozuldu!!!

In [136]:
df2

    1   2   3
0  36  42  41
1  41  37  35
2  43  34  42
3  40  34  42
4  36  36  43

In [137]:
df2.columns

Index(['1', '2', '3'], dtype='object')

In [141]:
pd.concat([df1,df2])

     1    2    3  var1  var2  var3
0  2.0  8.0  7.0   NaN   NaN   NaN
1  7.0  3.0  1.0   NaN   NaN   NaN
2  9.0  0.0  8.0   NaN   NaN   NaN
3  6.0  0.0  8.0   NaN   NaN   NaN
4  2.0  2.0  9.0   NaN   NaN   NaN
0  NaN  NaN  NaN  36.0  42.0  41.0
1  NaN  NaN  NaN  41.0  37.0  35.0
2  NaN  NaN  NaN  43.0  34.0  42.0
3  NaN  NaN  NaN  40.0  34.0  42.0
4  NaN  NaN  NaN  36.0  36.0  43.0

In [142]:
pd.concat([df1,df2],join = 'inner')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 0, 1, 2, 3, 4]

In [146]:
pd.concat([df1,df2], join_axes = [df2.columns])

#bunun neden calismadigini anlamadim!!!

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [144]:
?join_axes

Object `join_axes` not found.

In [147]:
df1 = pd.DataFrame({'calisanlar':['Ali','Veli','Ayse'], 'grup':['Muhasebe','Muhendislik','IK']})

In [150]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse           IK

In [153]:
df2 = pd.DataFrame({'calisanlar':['Ayse','Ali','Veli','Fatma'], 'ilk_giris': [2010,2009,2014,2019]})

In [154]:
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [155]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse           IK       2010

In [156]:
pd.merge(df1,df2, on='calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse           IK       2010

In [157]:
df3 = pd.merge(df1,df2)

In [158]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse           IK       2010

In [159]:
import seaborn as sns

In [160]:
df = sns.load_dataset('planets')

In [161]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [163]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [164]:
df.shape

(1035, 6)

In [165]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [167]:
df['mass'].mean()

2.6381605847953233

In [168]:
df['mass'].count()

513

In [169]:
df['mass'].min()

0.0036

In [170]:
df['mass'].max()

25.0

In [171]:
df['mass'].sum()

1353.37638

In [172]:
df['mass'].std()

3.8186166509616046

In [174]:
df['mass'].var()
#varyans hesabi

14.58183312700122

In [175]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [176]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [177]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse           IK

In [178]:
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [179]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse           IK       2010

In [182]:
df3.groupby('grup')
#bu kod ile python Muhasebe.Muhendislik ve IK  yi tuttu

In [183]:
df3.groupby('grup').mean()

             ilk_giris
grup
IK                2010
Muhasebe          2009
Muhendislik       2014

In [184]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [185]:
df.groupby('method')

In [186]:
df.groupby('method')['orbital_period']

In [188]:
df.groupby('method')['orbital_period'].mean()
#method a gore grupladi ve orbital perioda gore de ortalama aldi

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [189]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [191]:
df.groupby('method').aggregate(['min', np.median, max])
#kendimiz gormek istedigimiz seyleri aggregate ile belirtiyoruz, describe daki her seyi gormk istemiyorsak

                              number            orbital_period                \
                                 min median max            min        median
method
Astrometry                         1      1   1     246.360000    631.180000
Eclipse Timing Variations          1      2   2    1916.250000   4343.500000
Imaging                            1      1   4    4639.150000  27500.000000
Microlensing                       1      1   2    1825.000000   3300.000000
Orbital Brightness Modulation      1      2   2       0.240104      0.342887
Pulsar Timing                      1      3   3       0.090706     66.541900
Pulsation Timing Variations        1      1   1    1170.000000   1170.000000
Radial Velocity                    1      1   6       0.736540    360.200000
Transit                            1      1   7       0.355000      5.714932
Transit Timing Variations          2      2   3      22.339500     57.011000

                                                mass               distance  \
                                         max     min median    max      min
method
Astrometry                       1016.000000     NaN    NaN    NaN    14.98
Eclipse Timing Variations       10220.000000  4.2000  5.125   6.05   130.72
Imaging                        730000.000000     NaN    NaN    NaN     7.69
Microlensing                     5100.000000     NaN    NaN    NaN  1760.00
Orbital Brightness Modulation       1.544929     NaN    NaN    NaN  1180.00
Pulsar Timing                   36525.000000     NaN    NaN    NaN  1200.00
Pulsation Timing Variations      1170.000000     NaN    NaN    NaN      NaN
Radial Velocity                 17337.500000  0.0036  1.260  25.00     1.35
Transit                           331.600590  1.4700  1.470   1.47    38.00
Transit Timing Variations         160.000000     NaN    NaN    NaN   339.00

                                                  year
                                 median      max   min  median   max
method
Astrometry                       17.875    20.77  2010  2011.5  2013
Eclipse Timing Variations       315.360   500.00  2008  2010.0  2012
Imaging                          40.395   165.00  2004  2009.0  2013
Microlensing                   3840.000  7720.00  2004  2010.0  2013
Orbital Brightness Modulation  1180.000  1180.00  2011  2011.0  2013
Pulsar Timing                  1200.000  1200.00  1992  1994.0  2011
Pulsation Timing Variations         NaN      NaN  2007  2007.0  2007
Radial Velocity                  40.445   354.00  1989  2009.0  2014
Transit                         341.000  8500.00  2002  2012.0  2014
Transit Timing Variations       855.000  2119.00  2011  2012.5  2014

In [193]:
df.groupby('method').aggregate({'mass': 'min', 'number':'max'})
# tablodaki mass icin min degeri dondursun, number icin de max degerini dondursun demis oldum

                                 mass  number
method
Astrometry                        NaN       1
Eclipse Timing Variations      4.2000       2
Imaging                           NaN       4
Microlensing                      NaN       2
Orbital Brightness Modulation     NaN       2
Pulsar Timing                     NaN       3
Pulsation Timing Variations       NaN       1
Radial Velocity                0.0036       6
Transit                        1.4700       7
Transit Timing Variations         NaN       3

In [194]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [203]:
def filter_func(x):
    return x['distance'].std() > 9

In [204]:
df.groupby('mass').filter(filter_func)

              method  number  orbital_period   mass  distance  year
2    Radial Velocity       1       763.00000  2.600     19.84  2011
9    Radial Velocity       2       452.80000  1.990     74.79  2010
12   Radial Velocity       1       479.10000  3.880     97.28  2008
17   Radial Velocity       5        14.65100  0.800     12.53  1996
19   Radial Velocity       5      4909.00000  3.530     12.53  2002
..               ...     ...             ...    ...       ...   ...
629  Radial Velocity       3       147.73000  1.280     52.88  2006
640  Radial Velocity       1       111.70000  2.100     14.90  2009
642  Radial Velocity       1       311.28800  1.940     17.24  1999
649          Transit       1         2.70339  1.470    178.00  2013
784  Radial Velocity       3       580.00000  0.947    135.00  2012

[166 rows x 6 columns]

In [205]:
df.transform(lambda x: x-x.mean())

        distance       mass method    number  orbital_period      year
0    -186.669282   4.461839    NaN -0.785507    -1733.617596 -3.070531
1    -207.119282  -0.428161    NaN -0.785507    -1128.143596 -1.070531
2    -244.229282  -0.038161    NaN -0.785507    -1239.917596  1.929469
3    -153.449282  16.761839    NaN -0.785507    -1676.887596 -2.070531
4    -144.599282   7.861839    NaN -0.785507    -1486.697596 -0.070531
...          ...        ...    ...       ...             ...       ...
1030  -92.069282        NaN    NaN -0.785507    -1998.976089 -3.070531
1031 -116.069282        NaN    NaN -0.785507    -2000.301732 -2.070531
1032  -90.069282        NaN    NaN -0.785507    -1999.726072 -2.070531
1033   28.930718        NaN    NaN -0.785507    -1998.792513 -1.070531
1034   -4.069282        NaN    NaN -0.785507    -1998.729839 -1.070531

[1035 rows x 6 columns]

In [206]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [208]:
df.apply(np.sum)
# apply icerisine kendi tanimladigimiz bir fonksiyonu da calistirabiliriz

method            Radial VelocityRadial VelocityRadial VelocityR...
number                                                         1848
orbital_period                                       1986894.255326
mass                                                     1353.37638
distance                                                  213367.98
year                                                        2079388
dtype: object

In [209]:
titanic = sns.load_dataset('titanic')

In [210]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [211]:
#ornegin cinsiyete gore veriyi gruplayip sag kalma yuzdelerini inceleyelim
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [213]:
titanic.groupby(['sex','class'])[['survived']].aggregate('mean').unstack()
# unstack deyince daha okunur halde gosteriyor!!!

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [214]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [216]:
titanic.pivot_table('survived',index = 'sex',columns = 'class')
#index satir olmus oldu, column da sutun

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [217]:
titanic.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [218]:
age = pd.cut(titanic['age'], [0,18,90])

In [219]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [220]:
titanic.pivot_table('survived',['sex',age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [228]:
pd.read_csv('~/Desktop/ornekcsv.csv', sep = ';')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [229]:
#txt de okunabiliyor
pd.read_csv('~/Desktop/duz_metin.txt')

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [230]:
pd.read_excel('~/Desktop/ornekx.xlsx')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [233]:
#indirme yaptigimizda bazen html olarak iniyor, bunu nasil acacagiz?
#hoca kopyala yapistir yapiyor, txt formatinda bir dosyaya verileri